Разработка_GZ/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮрФизЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйОрган</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГосударственногоОргана</name>
    <type>
      <types>EnumRef.ВидыГосударственныхОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГосударственногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>regNum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>consRegistryNum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>fullName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГЗ_Регион</name>
    <type>
      <types>CatalogRef.ГЗ_Регионы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКонтактнойИнформации</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Разработка_GZ/src/Enums/ВидыГосударственныхОрганов/ВидыГосударственныхОрганов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыГосударственныхОрганов</name>
  <enumValues>
    <name>НалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>ОрганФСС</name>
  </enumValues>
  <enumValues>
    <name>ОрганПФР</name>
  </enumValues>
  <enumValues>
    <name>Прочий</name>
  </enumValues>
</mdclass:Enum>

Разработка_GZ/src/Catalogs/Контрагенты/Forms/ПлатежныеРеквизитыГосударственныхОрганов/Module.bsl
&НаКлиенте 
Перем ТекущийТекстНомераСчета; // Текст, набранный в поле ввода номера счета

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ОткрытИзПлатежногоПоручения Тогда
		Элементы.КодГосударственногоОргана.Видимость        = Ложь;
		Элементы.ГосударственныйОрганНаименование.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("КодГосударственногоОргана")
		И ЗначениеЗаполнено(Параметры.КодГосударственногоОргана)
		И Параметры.Свойство("ВидГосударственногоОргана")
		И ЗначениеЗаполнено(Параметры.ВидГосударственногоОргана) Тогда
		КодГосударственногоОргана = Параметры.КодГосударственногоОргана;
		ВидГосударственногоОргана = Параметры.ВидГосударственногоОргана;
	ИначеЕсли Параметры.Свойство("РегистрацияВНалоговомОргане")
		И ЗначениеЗаполнено(Параметры.РегистрацияВНалоговомОргане) Тогда
		КодГосударственногоОргана = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.РегистрацияВНалоговомОргане, "Код");
		ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган;
	Иначе
		ВызватьИсключение НСтр("ru = 'Не указаны реквизиты государственного органа'");
	КонецЕсли;
	
	Если Параметры.ОткрытИзПлатежногоПоручения Тогда
		Заголовок = ЗаголовокДляПлатежногоПоручения(ВидГосударственногоОргана);
	Иначе
		Заголовок = ЗаголовокДляОрганизации(ВидГосударственногоОргана);
	КонецЕсли;
	
	Данные = ДанныеГосударственныхОрганов.ГосударственныйОрган(ВидГосударственногоОргана, КодГосударственногоОргана);
	
	ГосударственныйОрганБанк = Данные.ПлатежныеРеквизиты.Банк;
	ГосударственныйОрганБИК  = Данные.ПлатежныеРеквизиты.БИК;
	ГосударственныйОрганИНН  = Данные.ИНН;
	ГосударственныйОрганКПП  = Данные.КПП;
	ГосударственныйОрганНаименование    = Данные.ПолноеНаименование;
	ГосударственныйОрганРасчетныйСчет   = Данные.ПлатежныеРеквизиты.РасчетныйСчет;
	ГосударственныйОрганТекстПолучателя = Данные.ПлатежныеРеквизиты.ПолучательПлатежа;
	ДеятельностьБанкаПрекращена = ДеятельностьБанкаПрекращена(ГосударственныйОрганБИК);
	
	Если Параметры.Свойство("НаименованиеГосударственногоОргана")
		И НЕ ЗначениеЗаполнено(ГосударственныйОрганНаименование) Тогда
		ГосударственныйОрганНаименование = Параметры.НаименованиеГосударственногоОргана;
	КонецЕсли;
	
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.Справочники.Контрагенты) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЦветВыделенияНекорректногоЗначение = ЦветаСтиля.ЦветВыделенияКонтрагентаСОшибкой;
	
	ПодсказкаБанк = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляБанка(ДеятельностьБанкаПрекращена);
	Элементы.ПодсказкаБанк.Видимость = ЗначениеЗаполнено(ПодсказкаБанк);
	ПодсказкаНомерСчета = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляНомерСчета(
		ГосударственныйОрганРасчетныйСчет, ГосударственныйОрганБИК, Истина, ЦветВыделенияНекорректногоЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Модифицированность = Ложь;
	ПеренестиВДокумент = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		ЗаписатьДанныеОПлатежныхРеквизитах();
		
		Закрыть(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГосударственныйОрганБанкПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ГосударственныйОрганБанк) Тогда
		ГосударственныйОрганБИК = "";
		ДеятельностьБанкаПрекращена = Ложь;
	КонецЕсли;
	
	ПодсказкаБанк = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляБанка(ДеятельностьБанкаПрекращена);
	Элементы.ПодсказкаБанк.Видимость = ЗначениеЗаполнено(ПодсказкаБанк);
	
	Если ЗначениеЗаполнено(ГосударственныйОрганРасчетныйСчет) Тогда
		ПодсказкаНомерСчета = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляНомерСчета(
			ГосударственныйОрганРасчетныйСчет, ГосударственныйОрганБИК, Истина, ЦветВыделенияНекорректногоЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГосударственныйОрганБанкОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РеквизитыБанка = БанковскиеСчетаФормыКлиент.ПолучитьДанныеБанка(ВыбранноеЗначение);
	ВыбранноеЗначение = РеквизитыБанка.Ссылка;
	
	Если ЗначениеЗаполнено (РеквизитыБанка.Ссылка) Тогда
		ГосударственныйОрганБИК = РеквизитыБанка.Код;
		ДеятельностьБанкаПрекращена = РеквизитыБанка.ДеятельностьПрекращена;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГосударственныйОрганБанкАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	БанковскиеСчетаФормыКлиент.БанкАвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка, ПараметрыПолученияДанных);

КонецПроцедуры

&НаКлиенте
Процедура НалоговыйОрганРасчетныйСчетПриИзменении(Элемент)

	ГосударственныйОрганРасчетныйСчет = СтрЗаменить(ГосударственныйОрганРасчетныйСчет," ","");
	
	ПодсказкаНомерСчета = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляНомерСчета(
		ГосударственныйОрганРасчетныйСчет, ГосударственныйОрганБИК, Истина, ЦветВыделенияНекорректногоЗначение)
	
КонецПроцедуры

&НаКлиенте
Процедура НалоговыйОрганРасчетныйСчетИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущийТекстНомераСчета = СтрЗаменить(Текст," ","");
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьПодсказкуНомераСчета", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДанныеОПлатежныхРеквизитах();
	
	ГосударственныйОрган = ДанныеГосударственныхОрганов.ГосударственныйОрган(ВидГосударственногоОргана, КодГосударственногоОргана);
	ГосударственныйОрган.Вид = ВидГосударственногоОргана;
	ГосударственныйОрган.Код = КодГосударственногоОргана;
	ГосударственныйОрган.ПолноеНаименование = ГосударственныйОрганНаименование;
	ГосударственныйОрган.ИНН = ГосударственныйОрганИНН;
	ГосударственныйОрган.КПП = ГосударственныйОрганКПП;
	Если НЕ ЗначениеЗаполнено(ГосударственныйОрган.Наименование) Тогда
		ГосударственныйОрган.Наименование = ГосударственныйОрганНаименование;
	КонецЕсли;
	ГосударственныйОрган.ПлатежныеРеквизиты.ПолучательПлатежа = ГосударственныйОрганТекстПолучателя;
	ГосударственныйОрган.ПлатежныеРеквизиты.РасчетныйСчет = ГосударственныйОрганРасчетныйСчет;
	ГосударственныйОрган.ПлатежныеРеквизиты.КоррСчет = "";
	ГосударственныйОрган.ПлатежныеРеквизиты.БИК = ГосударственныйОрганБИК;
	
	ДанныеГосударственныхОрганов.ОбновитьДанныеГосударственногоОргана(ГосударственныйОрган);
	
КонецПроцедуры

Функция ДеятельностьБанкаПрекращена(БИК)
	
	Результат = Ложь;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КлассификаторБанков.ДеятельностьПрекращена
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.Код = &БИК";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("БИК", БИК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДеятельностьПрекращена;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_УстановитьПодсказкуНомераСчета()
	
	Если Не БанковскиеПравила.ПроверитьДлинуНомераСчета(ТекущийТекстНомераСчета) Тогда
		ПодсказкаНомерСчета = БанковскиеСчетаФормыКлиент.ПодсказкаВводаПоляНомерСчета(ТекущийТекстНомераСчета, ГосударственныйОрганБИК);
	Иначе
		ПодсказкаНомерСчета = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляНомерСчета(
			ТекущийТекстНомераСчета, ГосударственныйОрганБИК, Истина, ЦветВыделенияНекорректногоЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаголовокДляПлатежногоПоручения(ВидГосударственногоОргана)
	
	Если ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган Тогда
		Заголовок = НСтр("ru = 'Получатель платежа (налоговая инспекция)'");
	ИначеЕсли ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганПФР Тогда
		Заголовок = НСтр("ru = 'Получатель платежа (отделение ПФР)'");
	ИначеЕсли ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганФСС Тогда
		Заголовок = НСтр("ru = 'Получатель платежа (отделение ФСС)'");
	Иначе
		Заголовок = НСтр("ru = 'Получатель платежа'");
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаголовокДляОрганизации(ВидГосударственногоОргана)
	
	Если ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган Тогда
		Заголовок = НСтр("ru = 'Платежные реквизиты налоговой инспекции'");
	ИначеЕсли ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганПФР Тогда
		Заголовок = НСтр("ru = 'Платежные реквизиты отделения ПФР'");
	ИначеЕсли ВидГосударственногоОргана = Перечисления.ВидыГосударственныхОрганов.ОрганФСС Тогда
		Заголовок = НСтр("ru = 'Платежные реквизиты отделения ФСС'");
	Иначе
		Заголовок = НСтр("ru = 'Платежные реквизиты'");
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции




#КонецОбласти
